integration/performance/publisher-api-testing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.2 r1790748">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Retraced Publisher API Performance Testing" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PUBLISHER_API_ENDPOINT" elementType="Argument">
            <stringProp name="Argument.name">PUBLISHER_API_ENDPOINT</stringProp>
            <stringProp name="Argument.value">35.185.223.19</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PROJECT_ID" elementType="Argument">
            <stringProp name="Argument.name">PROJECT_ID</stringProp>
            <stringProp name="Argument.value">fc0db3252ba74b41ae88df0716f20f18</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ENVIRONMENT_ID" elementType="Argument">
            <stringProp name="Argument.name">ENVIRONMENT_ID</stringProp>
            <stringProp name="Argument.value">70b975a65ebf4e849262a49aae3d3712</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PUBLISHER_API_KEY" elementType="Argument">
            <stringProp name="Argument.name">PUBLISHER_API_KEY</stringProp>
            <stringProp name="Argument.value">token=b4f4fe252d034676ba4c7fd5056414b6</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Create Event Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <longProp name="ThreadGroup.start_time">1495052422000</longProp>
        <longProp name="ThreadGroup.end_time">1495052422000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Event HTTP Request Sampler" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;action&quot;: &quot;integration.test.api.${eventNumber}&quot;,&#xd;
	&quot;group&quot;: {&#xd;
	    &quot;id&quot;: &quot;rtrcdqa1234&quot;,&#xd;
	    &quot;name&quot;: &quot;RetracedQA&quot;&#xd;
	},&#xd;
	&quot;created&quot;: ${__time(/1000)},&#xd;
	&quot;crud&quot;: &quot;c&quot;,&#xd;
	&quot;sourceIp&quot;: &quot;192.168.0.1&quot;,&#xd;
	&quot;actor&quot;: {&#xd;
	    &quot;id&quot;: &quot;qa@retraced.io&quot;,&#xd;
	    &quot;name&quot;: &quot;RetracedQA Employee&quot;,&#xd;
	    &quot;href&quot;: &quot;https://retraced.io/employees/qa&quot;&#xd;
	},&#xd;
	&quot;target&quot;: {&#xd;
	    &quot;id&quot;: &quot;rtrcdapi&quot;,&#xd;
	    &quot;name&quot;: &quot;Retraced API&quot;,&#xd;
	    &quot;href&quot;: &quot;https://customertowne.xyz/records/rtrcdapi&quot;,&#xd;
	    &quot;type&quot;: &quot;integration&quot;&#xd;
	},&#xd;
	&quot;description&quot;: &quot;Automated integration testing...&quot;,&#xd;
	&quot;isFailure&quot;: false&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${PUBLISHER_API_ENDPOINT}</stringProp>
          <stringProp name="HTTPSampler.port">3000</stringProp>
          <stringProp name="HTTPSampler.path">/publisher/v1/project/${PROJECT_ID}/event</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${PUBLISHER_API_KEY}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Event Number" enabled="true">
            <stringProp name="maximumValue">99999</stringProp>
            <stringProp name="minimumValue">1</stringProp>
            <boolProp name="perThread">false</boolProp>
            <stringProp name="randomSeed">5913</stringProp>
            <stringProp name="variableName">eventNumber</stringProp>
          </RandomVariableConfig>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>